; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=43, out_folder=htg/blocksworld/training, instance_id=23, seed=2047, goal_proportion=0.1

(define (problem blocksworld-23)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 - object)
 (:init 
    (arm-empty)
    (clear b6)
    (on b6 b16)
    (on-table b16)
    (clear b1)
    (on b1 b17)
    (on b17 b22)
    (on b22 b32)
    (on-table b32)
    (clear b10)
    (on b10 b30)
    (on b30 b40)
    (on b40 b38)
    (on b38 b37)
    (on b37 b7)
    (on b7 b25)
    (on b25 b23)
    (on-table b23)
    (clear b43)
    (on b43 b33)
    (on b33 b21)
    (on b21 b5)
    (on-table b5)
    (clear b13)
    (on b13 b20)
    (on b20 b36)
    (on-table b36)
    (clear b12)
    (on-table b12)
    (clear b28)
    (on b28 b42)
    (on b42 b2)
    (on b2 b39)
    (on-table b39)
    (clear b18)
    (on b18 b35)
    (on b35 b24)
    (on b24 b14)
    (on b14 b34)
    (on b34 b11)
    (on b11 b19)
    (on b19 b8)
    (on-table b8)
    (clear b3)
    (on b3 b29)
    (on b29 b26)
    (on b26 b4)
    (on-table b4)
    (clear b27)
    (on b27 b9)
    (on-table b9)
    (clear b31)
    (on b31 b15)
    (on b15 b41)
    (on-table b41))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b4)
    (on b4 b1)
    (on-table b1)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b1 b17)
   deleted: (on b1 b17) (clear b1) (arm-empty)
   added: (holding b1) (clear b17)
   goals met: 1 of 7
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 7
3. (unstack b3 b29)
   deleted: (on b3 b29) (clear b3) (arm-empty)
   added: (holding b3) (clear b29)
   goals met: 1 of 7
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 7
5. (unstack b28 b42)
   deleted: (on b28 b42) (clear b28) (arm-empty)
   added: (holding b28) (clear b42)
   goals met: 3 of 7
6. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 3 of 7
7. (unstack b42 b2)
   deleted: (on b42 b2) (clear b42) (arm-empty)
   added: (holding b42) (clear b2)
   goals met: 4 of 7
8. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 4 of 7
9. (unstack b2 b39)
   deleted: (on b2 b39) (clear b2) (arm-empty)
   added: (holding b2) (clear b39)
   goals met: 3 of 7
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 7
11. (unstack b29 b26)
   deleted: (on b29 b26) (clear b29) (arm-empty)
   added: (holding b29) (clear b26)
   goals met: 5 of 7
12. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 5 of 7
13. (unstack b26 b4)
   deleted: (on b26 b4) (clear b26) (arm-empty)
   added: (holding b26) (clear b4)
   goals met: 6 of 7
14. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 6 of 7
15. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 7
16. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 7 of 7
